eisup_2019_docmng_integration/src/Documents/абс_КомплектацияОСРЖД/абс_КомплектацияОСРЖД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_КомплектацияОСРЖД</name>
  <basedOn>Document.абс_КомплектацияОС</basedOn>
  <registerRecords>AccumulationRegister.абс_СтоимостьОСРЖД</registerRecords>
  <registerRecords>AccountingRegister.абс_МеждународныйОСРЖД</registerRecords>
  <registerRecords>InformationRegister.абс_ОсновныеСредстваРЖД</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.абс_КомплектацияОС</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавноеОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетСниженияСтоимости</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </attributes>
  <attributes>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентУскорения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачислятьАмортизацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеСредства</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/Documents/абс_КомплектацияОСРЖД/Forms/ФормаДокумента/Module.bsl
/////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ЗначенияЗаполнения.Количество()>0 Тогда
		ЗаполнитьЗначенияСвойств(Объект, Параметры.ЗначенияЗаполнения);
	КонецЕсли;
	
	УстановитьОформлениеГлавногоОС();
	
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////////
// Обработчики событий элементов формы

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	ДокументОснованиеПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ДокументОснованиеПриИзмененииНаСервере();
	
	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	Док = РеквизитФормыВЗначение("Объект");
	Док.Заполнить(Объект.ДокументОснование);
	ЗначениеВРеквизитФормы(Док, "Объект");
	УстановитьОформлениеГлавногоОС();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОснованию(Команда)
	
	ДокументОснованиеПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	Если ТекущиеДанные=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ГлавноеОсновноеСредство=ТекущиеДанные.ОсновноеСредство Тогда
		Объект.ГлавноеОсновноеСредство = ПредопределенноеЗначение("Справочник.ОсновныеСредства.ПустаяСсылка");
		УстановитьОформлениеГлавногоОС();
	КонецЕсли;
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////
// Обработчики команд формы

&НаКлиенте
Процедура УстановитьГлавным(Команда)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	Если ТекущиеДанные=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ГлавноеОсновноеСредство<>ТекущиеДанные.ОсновноеСредство Тогда
		
		Если Вопрос("Параметры учета будут заменены! Продолжить?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да)=КодВозвратаДиалога.Да Тогда
			
			Объект.ГлавноеОсновноеСредство = ТекущиеДанные.ОсновноеСредство;
			УстановитьОформлениеГлавногоОС();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////
// Служебные процедуры и функции

&НаСервере
Процедура УстановитьОформлениеГлавногоОС()
	
	Если ЗначениеЗаполнено(Объект.ГлавноеОсновноеСредство) Тогда
		ЭтаФорма.УсловноеОформление.Элементы[0].Использование = Истина;
		ЭтаФорма.УсловноеОформление.Элементы[0].Отбор.Элементы[0].ПравоеЗначение = Объект.ГлавноеОсновноеСредство;
	Иначе
		ЭтаФорма.УсловноеОформление.Элементы[0].Использование = Ложь;
	КонецЕсли;
	
КонецПроцедуры
